app/views/users/show.html.erb

<p>
  <% @user.microposts.each do |micropost| %>
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."id" ASC LIMIT ?  [["user_id", 5], ["LIMIT", 1]]